In [1]:
import pandas as pd
import mysql.connector

In [7]:
import sys
# reload(sys)
# sys.setdefaultencoding('utf-8')
sys.getdefaultencoding()

'utf-8'

In [8]:
config = {
        'user': 'root',
        'password': 'root',
        'host': 'db',
        'port': 3306,
        'database': 'SQLIntro',
#         'init_command': 'set names utf8',
        'charset': 'cp1251'
    }

In [9]:
connection = mysql.connector.connect(**config)
# cursor = connection.cursor()
# cursor.execute('SELECT * FROM favorite_colors')

In [10]:
# mysql_cn= MySQLdb.connect(**config)
df_mysql = pd.read_sql('select * from book;', con=connection)    
print ('loaded dataframe from MySQL. records:', len(df_mysql))
connection.close()

loaded dataframe from MySQL. records: 4

In [11]:
df_mysql

,book_id,title,author,price,amount
0,1,???°???‚?µ?€ ?? ???°?€???°?€???‚?°,?‘???»???°?????? ??.??.,670.99,3
1,2,?‘?µ?»?°?? ?????°?€??????,?‘???»???°?????? ??.??.,540.50,5
2,3,?????????‚,?”?????‚???µ?????????? ?¤.??.,460.00,10
3,4,?‘?€?°?‚???? ???°?€?°???°?·?????‹,?”?????‚???µ?????????? ?¤.??.,799.01,2